Enums/Цвета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>Цвета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Красный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Синий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Желтый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зеленый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Коричневый</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ОбщийМодульСервер/Ext/Module.bsl
Процедура ПеремешатьМассив(Массив) Экспорт
    
    Генератор = Новый ГенераторСлучайныхЧисел();
	
	Для Шаг1 = 0 По Массив.ВГраница() Цикл
		
		// Определяем случайный элемент массива
        Шаг2 = Генератор.СлучайноеЧисло(0, Массив.ВГраница());
		
		// Меняем местами элеметы массива
        Врем = Массив[Шаг1];
        Массив[Шаг1] = Массив[Шаг2];
        Массив[Шаг2] = Врем;
    КонецЦикла;
	
КонецПроцедуры

Процедура ЗаполнитьЦвета(Форма) Экспорт
	
	Структура = Новый Структура;
	
	Структура.Вставить("Красный", "red");
	Структура.Вставить("Синий", "blue");
	Структура.Вставить("Зеленый", "green");
	Структура.Вставить("Желтый", "yellow");
	Структура.Вставить("Коричневый", "brown");
	
	Форма.ЦветаСтруктура = Структура;
	
КонецПроцедуры

Функция ПолучитьТекущегоИгрока() Экспорт
	Возврат ПараметрыСеанса.ТекущийИгрок;	
КонецФункции

Процедура ДополнитьПоселениями(Структура) Экспорт

	Для каждого Цвет Из Перечисления.Цвета Цикл
		
		Структура.Вставить("" + Цвет + "Поселение");
	    
	КонецЦикла;

КонецПроцедуры

Процедура ДополнитьГородами(Структура) Экспорт
	
	Для каждого Цвет Из Перечисления.Цвета Цикл
		
		Структура.Вставить("" + Цвет + "Город");
	    
	КонецЦикла;

	
КонецПроцедуры
